Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadCombination Methods
The AnalysisLoadCombination type exposes the following members.
Methods
Name | Description
Delete
 Deletes an analysis load combination. The AnalysisModelName and ID have to be set.
Insert
 Inserts an analysis load combination. The AnalysisModelName has to be set.
Modify
 Modifies an analysis load combination. The AnalysisModelName and ID have to be set.
Select
 Selects an analysis load combination. The AnalysisModelName and ID have to be set.
 (Overrides AnalysisObject.Select().)
SetLoads
 Sets the loads.
Top
See Also
Reference
AnalysisLoadCombination Class
Tekla.Structures.Analysis Namespace